Enza.UTM.DataAccess.Services/Requests/S2SCreateSowingListRequest.st

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://contract.enzazaden.com/seed2seed/v1" xmlns:seed="http://contract.enzazaden.com/seed2seed">
  <soapenv:Header/>
  <soapenv:Body>
    <v1:createSowingListRequest>
      <v1:Year></v1:Year>
      <v1:Crop>$Model.CropCode$</v1:Crop>
      <v1:CapacitySlotId>$Model.CapacitySlotID$</v1:CapacitySlotId>
      <v1:SowingCode>$Model.CapacitySlotName$</v1:SowingCode>
      <seed:DonorsList>
        <!--1 or more repetitions:-->
        $Model.Donors:{donor|
        <seed:Donor>
          <!--Optional:-->
          <seed:MasterNumber>$donor.MasterNumber$</seed:MasterNumber>
          <seed:BreEZysPKReference>$donor.BreezysPKReference$</seed:BreEZysPKReference>
          <seed:BreEZysId>$donor.BreezysID$</seed:BreEZysId>
          <!--Optional:-->
          <seed:BreEZysRefCode>$donor.BreezysRefCode$</seed:BreEZysRefCode>
          <seed:BreedingStation>$donor.BreedingStation$</seed:BreedingStation>
          <seed:BreEzysAdministration>$donor.BreEzysAdminstration$</seed:BreEzysAdministration>
          <seed:ResearchGroup></seed:ResearchGroup>
          <seed:Project>$donor.Project$</seed:Project>
          <!--Optional:-->
          <seed:DonorNumber>$donor.DonorNumber$</seed:DonorNumber>
          <!--Optional:-->
          <seed:DonorPlantNumber>$donor.DonorPlantNumber$</seed:DonorPlantNumber>
          <!--Optional:-->
          <seed:Type></seed:Type>
          <!--Optional:-->
          <seed:Medium></seed:Medium>
          <!--Optional:-->
          <seed:LotNumber>$donor.LotNumber$</seed:LotNumber>
          <seed:CrossingYear>$donor.CrossingYear$</seed:CrossingYear>
          <!--Optional:-->
          <seed:NrOfSeeds>$donor.NrOfSeeds$</seed:NrOfSeeds>
          <!--Optional:-->
          <seed:NrOfPlannedTransplanted>$donor.NrOfPlannedTransplanted$</seed:NrOfPlannedTransplanted>
          <!--Optional:-->
          <seed:NrOfPlannedDHEmbryoRescueNett>$donor.NrOfPlannedDHEmbryoRescueNett$</seed:NrOfPlannedDHEmbryoRescueNett>
          <!--Optional:-->
          <seed:NrOfPlannedDHEmbryoRescueGross>$donor.NrOfPlannedDHEmbryoRescueGross$</seed:NrOfPlannedDHEmbryoRescueGross>
          <!--Optional:-->
          <seed:StemBookShort></seed:StemBookShort>
          <!--Optional:-->
          <seed:Generation></seed:Generation>
          <!--Optional:-->
          <seed:Program></seed:Program>
          <!--Optional:-->
          <seed:Stem></seed:Stem>
          <!--Optional:-->
          <seed:Tail></seed:Tail>
          <!--Optional:-->
          <seed:ParentLineMale></seed:ParentLineMale>
          <!--Optional:-->
          <seed:ParentLineFemale></seed:ParentLineFemale>
          <seed:DonorMarkerTestNeeded></seed:DonorMarkerTestNeeded>
          <seed:DH0MakerTestNeeded>$donor.DH0MakerTestNeeded$</seed:DH0MakerTestNeeded>
          <seed:RemarksList/>
        </seed:Donor>
        }$
      </seed:DonorsList>
    </v1:createSowingListRequest>
  </soapenv:Body>
</soapenv:Envelope>